AlperenGulec/wifi-human-tracking/esp32/rx/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"

# 1 ms tick, so vTaskDelayUntil(20 ms) is exact
CONFIG_FREERTOS_HZ=1000

# the whole point
CONFIG_ESP_WIFI_CSI_ENABLED=y

# keep our loop off core 0, which the Wi-Fi driver owns
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Matches UART_BAUD in main/config.h. Only affects early boot messages
# (our own uart_param_config() call takes over once app_main runs), but kept
# equal so boot garbage isn't printed at a different rate than the real stream.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=460800
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
